cases/flowCaseBig/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Guimaraes small domain -- RECENTRED frame
     \\/     M anipulation  | (adapted from the source-city template)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// atmospheric BCs (atmBoundaryLayerInlet*, atm*WallFunction, freestreamPressure)
// live in the ESI atmosphericModels library:
libs            (atmosphericModels);

application     simpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3000;          // max SIMPLE iters; residualControl stops earlier
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    #include "FOwallClockTimeStatistics"
}
// ************************************************************************* //
