cases/flowCaseBig/system/fvSchemes_1storder
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }
// 1st-ORDER (bounded) schemes: upwind on k/epsilon keeps turbulence bounded on the
// stiff terrain mesh. Use for the initial run; then restart with fvSchemes_2ndorder.
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes      { default steadyState; }
gradSchemes
{
    default     cellLimited Gauss linear 1;
    limited     cellLimited Gauss linear 1;
    grad(U)     $limited;
    grad(k)     $limited;
    grad(epsilon) $limited;
}
divSchemes
{
    default          none;
    div(phi,U)       bounded Gauss linearUpwindV limited;
    div(phi,k)       bounded Gauss upwind;
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,omega)   bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes     { default Gauss linear limited 0.5; }
interpolationSchemes { default linear; }
snGradSchemes        { default limited 0.5; }
wallDist             { method meshWave; }
// ************************************************************************* //
